In [6]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import csv
from datetime import datetime

In [14]:
#read the file
fare_data = pd.read_csv("sample.csv")
temp_data=pd.read_csv("temperature.csv")
temp_data = temp_data[['date','New York']]
temp_data.head()

                  date    New York
0  2012-10-01 12:00:00         NaN
1  2012-10-01 13:00:00  288.220000
2  2012-10-01 14:00:00  288.247676
3  2012-10-01 15:00:00  288.326940
4  2012-10-01 16:00:00  288.406203

In [3]:
#check data type
temp_data.dtypes

date         object
New York    float64
dtype: object

In [15]:
#convert date from strings to timestamp
temp_data['timestamp'] = [datetime.strptime(d, "%Y-%m-%d %H:%M:%S") for d in temp_data["date"]]
temp_data.head()
fare_data.head()

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,4173371,2009-04-02 18:05:23.0000002,4.5,2009-04-02 18:05:23 UTC,-73.986443,40.742324,-73.978910,40.751868,1
1,27089190,2012-01-11 21:24:00.00000083,4.9,2012-01-11 21:24:00 UTC,-73.971187,40.761860,-73.957532,40.770272,1
2,35562355,2011-04-29 07:08:00.00000032,49.8,2011-04-29 07:08:00 UTC,-73.981512,40.780340,-73.785602,40.643153,1
3,45816638,2009-07-28 01:04:17.0000002,5.3,2009-07-28 01:04:17 UTC,-73.985720,40.763791,-73.971801,40.755105,1
4,21768376,2013-08-05 11:25:13.0000001,17.0,2013-08-05 11:25:13 UTC,-74.014908,40.709413,-73.995570,40.723334,2

In [9]:
#clean fare_data time format
fare_data['new_time'] = (fare_data['pickup_datetime']).apply(lambda x: datetime.strptime(x, "%Y-%m-%d %H:%M:%S %Z"))    
fare_data = fare_data.drop(['Unnamed: 0','key','pickup_datetime'], axis=1)
time_range = (fare_data['new_time'] > "2013-01-01") & (fare_data['new_time'] < "2016-12-31")
ranged_data = fare_data.loc[time_range]
ranged_data.tail()

,fare_amount,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,new_time
19992,4.00,-73.951087,40.782975,-73.944410,40.787859,1,2014-03-21 20:10:03
19994,10.00,-73.962387,40.778793,-73.977386,40.758976,3,2015-06-13 14:10:28
19996,28.50,-74.007112,40.718224,-73.934912,40.798347,1,2014-10-01 21:41:34
19997,34.33,-73.863623,40.769963,-73.993245,40.736136,1,2013-08-18 19:56:05
19999,21.00,-73.992033,40.768967,-73.980294,40.714079,1,2013-06-10 07:14:54

In [17]:
#grab the hour of the fare_data
temp_data['new_date']=temp_data.timestamp.dt.date
temp_data['new_hour']=temp_data.timestamp.dt.hour

temp_data.head()

                  date    New York           timestamp    new_date  new_hour
0  2012-10-01 12:00:00         NaN 2012-10-01 12:00:00  2012-10-01        12
1  2012-10-01 13:00:00  288.220000 2012-10-01 13:00:00  2012-10-01        13
2  2012-10-01 14:00:00  288.247676 2012-10-01 14:00:00  2012-10-01        14
3  2012-10-01 15:00:00  288.326940 2012-10-01 15:00:00  2012-10-01        15
4  2012-10-01 16:00:00  288.406203 2012-10-01 16:00:00  2012-10-01        16

In [ ]:

combined_fare_temp_df = pd.merge(fare_data, temp_data[['date','New York']],
                                 how='left', on='new_date' and 'new_hour')
#combined_fare_temp_df.head()